Repository: Kostenkov-2021/WhatsApp-Enhancer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru, uk

source: WhatsApp Enhancer
ru: Улучшения для WhatsApp
uk: Покращувач WhatsApp

source: Toggle phone number filtering in speech
ru: Включить/выключить фильтрацию номеров телефонов при произнесении

source: on
ru: включено

source: off
ru: выключено

source: Phone number filtering {state}
ru: Фильтрация номеров телефонов: {state}

source: Error accessing configuration
ru: Ошибка доступа к конфигурации

source: Review previous character of last spoken text
ru: Просмотреть предыдущий символ последнего произнесённого текста

source: Review next character of last spoken text
ru: Просмотреть следующий символ последнего произнесённого текста

source: Review previous word of last spoken text
ru: Просмотреть предыдущее слово последнего произнесённого текста

source: Review next word of last spoken text
ru: Просмотреть следующее слово последнего произнесённого текста

source: Review previous line of last spoken text
ru: Просмотреть предыдущую строку последнего произнесённого текста

source: Review next line of last spoken text
ru: Просмотреть следующую строку последнего произнесённого текста

source: Focus the chat list
ru: Переместить фокус на список чатов

source: Focus the message composer
ru: Переместить фокус на поле ввода сообщения

source: Focus the message list
ru: Переместить фокус на список сообщений

source: Report accessibility properties of focused object
ru: Озвучить свойства доступности объекта в фокусе

source: Read current chat title. Double press to toggle activity tracking.
ru: Озвучить название текущего чата. Двойное нажатие переключает отслеживание активности.

source: Toggle automatic reading of new messages
ru: Включить/выключить автоматическое чтение новых сообщений

source: Open current message in a dedicated text window
ru: Открыть текущее сообщение в отдельном текстовом окне

source: Copy current message to clipboard
ru: Скопировать текущее сообщение в буфер обмена

source: Initiate voice call
ru: Начать голосовой вызов

source: Initiate video call
ru: Начать видеовызов

source: Moves to the next object in a flattened view of the object navigation hierarchy
ru: Перейти к следующему объекту в плоском представлении иерархии объектной навигации

source: Moves to the previous object in a flattened view of the object navigation hierarchy
ru: Перейти к предыдущему объекту в плоском представлении иерархии объектной навигации

source: Prevents accidental toggling of Browse Mode in WhatsApp
ru: Предотвращает случайное переключение режима обзора в WhatsApp

source: Browse Mode is disabled for WhatsApp to ensure best experience.
ru: Для обеспечения наилучшего взаимодействия режим обзора в WhatsApp отключён.

source: Browse Mode disabled
ru: Режим обзора отключён

source: Filter phone numbers in chat headers
ru: Фильтровать номера телефонов в заголовках чатов
uk: Фільтрувати номери телефонів у заголовках чатів

source: Read usage hints while navigating chat list
ru: Озвучивать подсказки по использованию при перемещении по списку чатов
uk: Читати підказки щодо використання під час перегляду списку чатів

source: Disable browse mode lock (not recommended)
ru: Отключить блокировку режима обзора (не рекомендуется)
uk: Вимкнути блокування режиму огляду (не рекомендується)

source: WhatsApp Desktop Enhancer
ru: WhatsApp Desktop Enhancer (Улучшения для WhatsApp Desktop)
uk: Покращувач WhatsApp

source: Accessibility enhancements for WhatsApp Desktop (WebView2)
ru: Это дополнение добавляет улучшения доступности для WhatsApp Desktop на WebView2
uk: Покращення доступності для WhatsApp Desktop (WebView2)

source: added settings to disable browse mode locking
ru: добавлены настройки для отключения блокировки режима обзора

source: Option
uk: Опція

source: Review previous character
uk: Переглянути попередній символ

source: Review next character
uk: Переглянути наступний символ

source: Review previous word
uk: Переглянути попереднє слово

source: Review next word
uk: Переглянути наступне слово

source: Review previous line
uk: Переглянути попередній рядок

source: Review next line
uk: Переглянути наступний рядок

source: Inspector
uk: Інспектор

source: L:{left}, T:{top}, W:{width}, H:{height}
uk: Л:{left}, В:{top}, Ш:{width}, В:{height}

source: No Loc
uk: Місцерозташування невідоме

source: Role: {role}, {loc_str}, Name: '{name}', ID: {auto_id}
uk: Роль: {role}, {loc_str}, Назва: “{name}”, ID: {auto_id}

source: Dedicated text window
uk: Показує текст в окремому діалозі

source: Message Text
uk: Текст повідомлення

source: Copy message
uk: Копіювати повідомлення

source: Copied
uk: Скопійовано

source: Context menu
uk: Контекстне меню

source: Play voice message
uk: Відтворити голосове повідомлення

source: Open call menu
uk: Відкрити меню викликів

source: Toggle browse mode
uk: Перемкнути режим огляду

source: Browse Mode is disabled for WhatsApp
uk: Режим огляду вимкнено для WhatsApp

source: Progress: {val}
uk: Перебіг: {val}

source: added virtual menu for call menu and settings dialog remove some old scripts change button detections methode.
uk: додано віртуальне меню для меню виклику та діалога налаштувань видалено деякі старі скрипти змінено метод визначення кнопок.
